# Project: Tech Job Market Data Analysis (Brazil)

## Notebook 09 â€“ SQLite Data Exploration

This notebook demonstrates how to store and query the project dataset using SQLite.
The goal is to practice SQL queries for data analysis, simulating a real-world analytics workflow
where data is accessed from a relational database instead of flat files.

### Objectives

- Create a SQLite database from the project dataset
- Store the data in a relational table
- Execute SQL queries to answer analytical questions
- Compare SQL-based analysis with Pandas-based analysis

In [12]:
import sqlite3
import pandas as pd

### Dataset Validation

Before performing any SQL analysis, we validate that the dataset was correctly loaded
into the SQLite database. The preview below confirms that all expected columns
are present and that the data structure matches the original CSV file.

In [13]:
df = pd.read_csv("../datasets/tech_jobs_salaries.csv")
df.head()

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [14]:
import sqlite3

conn = sqlite3.connect("../databases/tech_jobs.db")

### Record Count Verification

This step ensures that all records from the original dataset were successfully
stored in the SQLite table. The total number of rows should match the number of
observations in the CSV file, confirming data integrity during the ingestion process.

In [15]:
df.to_sql(
    "tech_jobs",
    conn,
    if_exists="replace",
    index=False
)

607

In [16]:
query = """
SELECT name
FROM sqlite_master
WHERE type='table';
"""

pd.read_sql(query, conn)

        name
0  tech_jobs

### Average Salary by Experience Level

This analysis investigates how salaries vary according to professional experience.
Understanding this relationship is essential to identify career progression patterns
and to quantify the financial impact of seniority in the tech job market.

In [17]:
query = """
SELECT experience_level,
       ROUND(AVG(salary_in_usd), 2) AS avg_salary
FROM tech_jobs
GROUP BY experience_level
ORDER BY avg_salary DESC;
"""

pd.read_sql(query, conn)

  experience_level  avg_salary
0               EX   199392.04
1               SE   138617.29
2               MI    87996.06
3               EN    61643.32

The results show a clear and consistent salary progression across experience levels.

- Entry-level (EN) roles present the lowest average salaries, reflecting limited experience.
- Mid-level (MI) positions show a significant increase, indicating growing technical maturity.
- Senior-level (SE) professionals earn substantially more, highlighting their strategic value.
- Executive-level (EX) roles command the highest salaries, reinforcing the financial premium
  associated with leadership and decision-making responsibilities.

This progression aligns with real-world compensation structures in the technology sector.

### Top-Paying Job Titles

This query identifies the job titles with the highest average salaries in the dataset.
The goal is to highlight leadership and highly specialized roles that tend to receive
premium compensation in the tech industry.

In [18]:
query = """
SELECT job_title,
       ROUND(AVG(salary_in_usd), 2) AS avg_salary
FROM tech_jobs
GROUP BY job_title
ORDER BY avg_salary DESC
LIMIT 10;
"""

pd.read_sql(query, conn)

                  job_title  avg_salary
0       Data Analytics Lead   405000.00
1   Principal Data Engineer   328333.33
2    Financial Data Analyst   275000.00
3  Principal Data Scientist   215242.43
4  Director of Data Science   195074.00
5            Data Architect   177873.91
6    Applied Data Scientist   175655.00
7        Analytics Engineer   175000.00
8           Data Specialist   165000.00
9              Head of Data   160162.60

The results indicate that leadership and principal-level roles dominate the top salary rankings.

Positions such as Data Analytics Lead, Principal Data Engineer, and Principal Data Scientist
reflect a combination of advanced technical expertise and strategic responsibility.
These roles often involve decision-making, system design, and cross-team leadership,
which justifies their higher compensation.

This insight is particularly valuable for professionals planning long-term career paths
in data and AI-related fields.

### Salary Comparison by Remote Work Ratio

This analysis explores the relationship between remote work arrangements and salary levels.
It aims to understand whether fully remote, hybrid, or on-site roles offer different
compensation patterns in the tech job market.

In [19]:
query = """
SELECT remote_ratio,
       ROUND(AVG(salary_in_usd), 2) AS avg_salary,
       COUNT(*) AS total_jobs
FROM tech_jobs
GROUP BY remote_ratio
ORDER BY avg_salary DESC;
"""

pd.read_sql(query, conn)

   remote_ratio  avg_salary  total_jobs
0           100   122457.45         381
1             0   106354.62         127
2            50    80823.03          99

The results reveal interesting patterns regarding remote work:

- Fully remote positions (100%) present the highest average salaries and the largest number of roles.
- On-site positions (0%) have slightly lower average salaries.
- Hybrid roles (50%) show the lowest average salary among the three categories.

These findings suggest that fully remote positions may offer broader access to global opportunities
and higher-paying markets, reinforcing the growing importance of remote work in the tech industry.

In [20]:
conn.close()

### Conclusions

This notebook demonstrated how SQL can be effectively used to analyze real-world datasets
within a data analysis workflow.

By storing the dataset in a SQLite database and querying it using SQL, we replicated a
common industry scenario where analysts interact with relational databases rather than
flat files.

The analyses confirmed strong relationships between experience level, job title, remote work,
and salary, providing valuable insights into the tech job market. This approach complements
Pandas-based analysis and reinforces the importance of SQL as a core skill for data professionals.